mithunbabbira/fleet_manager/examples/synthetic_uart/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
